t/SIG38.out

<e:Envelope xmlns:e="http://schemas.xmlsoap.org/soap/envelope/"><e:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" e:actor="http://schemas.xmlsoap.org/soap/actor/next" e:mustUnderstand="1"><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#FWK"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>fbdS0qHp2AqBJtZAd+Gd08P5sDI=</ds:DigestValue></ds:Reference><ds:Reference URI="#TS"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>w9tIUOR0v9QKp8QV5MvztvISG8E=</ds:DigestValue></ds:Reference><ds:Reference URI="#MID"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>bKLmFxbWBKZJdGUJHZKtbNmmt6U=</ds:DigestValue></ds:Reference><ds:Reference URI="#TO"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>N12qUQKdAtRdsqOPKif7mNUJ1To=</ds:DigestValue></ds:Reference><ds:Reference URI="#REP"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>UNDWg8/olOcP0PmJvYUK9YBzH4Q=</ds:DigestValue></ds:Reference><ds:Reference URI="#PRV"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>sh1mM9ELocKYEdbMgjBDQiLwoAY=</ds:DigestValue></ds:Reference><ds:Reference URI="#STR"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>cCPfyqpeR101ZTbnutTP/JveuF8=</ds:DigestValue></ds:Reference><ds:Reference URI="#BDY"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>QNDzUSpwRfngBCer1fk943U1ndA=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>S27TzJHrHs2g7ncrUb7nbRkO/qHNRd/htO/3XzleH5vWISIgqUFeFcSY4IpXK4X5eU6Te2Js+oZpYsSjpLLcZOrQhj39I3I8UcktteV/yuCmweQE0hcCTBltxZbs0yMYp/I4xy2CLtyf+1SdcIOMj0Cf39Po+a1oovixNCueMJ8=</ds:SignatureValue></ds:Signature></wsse:Security></e:Header><e:Body id="BDY"><Persoon_dboGroupListElement xmlns="http://www.risaris.com/namespaces/Persoon_dbo"><tas3_id>TAS3_PSEUDO_NAMEID</tas3_id></Persoon_dboGroupListElement></e:Body></e:Envelope>
Canon sha1 if <wsse:Security> verified OK 5

SIG Verified OK, zxid_sp_sso_finalize() returned 5
